# IncludeStandaloneWorksetsOnly Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WorksetFilter..::..IncludeStandaloneWorksetsOnly Property
WorksetFilter Class See Also
---
True if the results of the filter only match stand-alone worksets; worksets that are not stand-alone will be rejected.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool IncludeStandaloneWorksetsOnly { get; set; }
```

Visual Basic
---
```text
Public Property IncludeStandaloneWorksetsOnly As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool IncludeStandaloneWorksetsOnly {
	bool get ();
	void set (bool value);
}
```

# See Also
WorksetFilter Class
Autodesk.Revit.DB Namespace